{
    "nav": {
        "market": "Market",
        "orders": "My Orders",
        "cart": "My Cart",
        "sales": "Sales",
        "product-management": "My Products",
        "about": "About",
        "login": "Login",
        "signup": "Sign-up",
        "logout": "Logout"
    },
    "home": {
        "title": "Unleash your creativity with Creator Emporium",
        "subtitle": "The ultimate source of DIY kits!",
        "m_info": "Learn more",
        "market": "Market"
    },
    "m_info": {
        "title": "Welcome to Creator Emporium - Your Online DIY Kit Store",
        "text1": "Welcome to Creator Emporium, the perfect place for all DIY enthusiasts! We are an online store specializing in the sale of DIY kits that allow you to unleash your creativity. Whether you're a beginner or an expert, our wide selection of kits will satisfy all your creative desires. Here's what you can expect when choosing Creator Emporium:",
        "text2": "DIY Kits for All Levels:",
        "text3": "Whether you want to learn a new technique or take on a more advanced challenge, we have kits suitable for all skill levels. Our packs are carefully designed with clear instructions and quality materials to ensure a successful DIY experience.",
        "text4": "A Variety of Exciting Projects:",
        "text5": "Explore our extensive range of DIY kits in various areas such as sewing, home decor, jewelry making, painting, and much more. Whether you prefer to create practical items or unique decorative pieces, we have the perfect kit for you.",
        "text6": "The Convenience of All-in-One:",
        "text7": "Our kits are designed to provide you with everything you need to complete your project. No more time wasted searching for necessary materials! With Creator Emporium, you'll receive a comprehensive set including supplies, tools, and detailed instructions, allowing you to get started right away.",
        "text8": "Quality Materials:",
        "text9": "We prioritize the quality of our products. All our kits are made with durable and carefully selected materials, ensuring long-lasting and aesthetic results. We ensure that every component of our kits meets our high standards.",
        "text10": "An Inspiring Community:",
        "text11": "Join the Creator Emporium community and connect with other DIY enthusiasts. Share your creations, exchange ideas, ask questions, and find inspiration for your next projects. Our community is a warm and supportive place where you can feel encouraged and supported.",
        "text12": "Whether you're looking for a new hobby, a unique gift, or simply a rewarding DIY experience, Creator Emporium is here to accompany you on your creative journey. Browse our online store today and let your imagination come to life with our exceptional DIY kits!"
    },
    "login": {
        "title": "Log-in:",
        "email": "E-mail",
        "placeholder_email": "name@example.com",
        "passwd": "Password",
        "placeholder_pwd": "Password",
        "button": "Log-in",
        "reg_question": "Don't have an account yet?",
        "register": "Sign-up"
    },
    "register": {
        "title": "Register:",
        "email": "Email Address",
        "email_error": "Please enter a valid email address",
        "placeholder_email": "Enter your email",
        "passwd": "Password",
        "pwd_error": "The password must be at least 6 characters long",
        "placeholder_pwd": "Enter your password",
        "button": "Register",
        "choices": "I want to register on CreatorCentral to:",
        "choice1": "buy articles",
        "choice2": "sell my products",
        "nickname": "Display Name",
        "placeholder_nickname": "Enter your nickname",
        "nick_desc": "This is the name that your customers will see.",
        "register": "Create an account"
    },
    "product_page": {
        "seller": "Sold by ",
        "stock1": "Only ",
        "stock2": " left",
        "CGV": "Read the terms and conditions of sale.",
        "add2cart": "Add to cart",
        "buy": "Buy now",
        "comments": "Comments:"
    },
    "modal": {
        "title": "General terms and conditions of sale:",
        "text1": "Before proceeding with your purchase, please carefully review the following terms and conditions:",
        "elem1": "Product Availability: The availability of the product is subject to change and may vary based on stock levels. We strive to maintain accurate inventory information, but there is a possibility that an item may become temporarily or permanently out of stock. In such cases, we will notify you promptly and provide alternative options or a refund.",
        "elem2": "Product Descriptions: We make every effort to provide accurate and detailed descriptions of our products. However, please note that product images, colors, and specifications may vary slightly from the actual product due to lighting conditions, monitor settings, or manufacturer updates. We encourage you to read the product details carefully and reach out to our customer support team if you have any specific questions.",
        "elem3": "Pricing and Payment: Prices listed on our website are subject to change without prior notice. While we strive to maintain accurate pricing information, occasional discrepancies may occur. In the event that a product is listed at an incorrect price, we reserve the right to cancel your order or contact you for further instructions. Please ensure that all payment details provided are accurate and up to date.",
        "elem4": "Shipping and Delivery: We endeavor to process and ship orders within the specified timeframes. However, please note that shipping times may vary based on your location, the shipping carrier, and any unforeseen circumstances. We cannot guarantee exact delivery dates but will provide you with tracking information to monitor your package's progress. Additional customs fees, duties, or taxes may apply for international orders.",
        "elem5": "Returns and Refunds: We have a comprehensive returns policy in place to ensure your satisfaction. If you encounter any issues with your purchase, please contact our customer support team within the designated timeframe specified in our return policy. Please note that certain products, such as personalized items or perishable goods, may not be eligible for return.",
        "text2": "By proceeding with your purchase, you acknowledge that you have read and understood the above terms and conditions. If you have any questions or concerns, please do not hesitate to reach out to our customer support team for further assistance.",
        "button": "Close"
    },
    "transactions": {
        "title1": "No history",
        "title2": "Sold products:",
        "title3": "Bought products:",
        "col1": "Date",
        "col2": "Product name",
        "col3": "Quantity",
        "col4": "Seller name",
        "col5": "Buyer name",
        "col6": "Total price"
    },
    "comment_form": {
        "pre_title": "Write a comment",
        "title": "Title",
        "placeholder_title": "Enter the comment title",
        "title_error": "The comment must have a title.",
        "description": "Description",
        "placeholder_desc": "Enter the product description",
        "grade": "Rating",
        "choose_grade": "Choose a rating",
        "grade_error": "Please select a rating",
        "button": "Submit Comment"
    },
    "new_product": {
        "title": "Add Product",
        "product_name": "Product Name",
        "placeholder_prod": "Enter the product name",
        "product_error": "The product must have a name.",
        "description": "Description",
        "placeholder_desc": "Enter the product description",
        "error_desc": "The product must have a description.",
        "image": "Add an Image",
        "error_image": "The product must have an image (png, jpg, or jpeg format).",
        "price": "Price",
        "placeholder_price": "Enter a price",
        "error_price": "The price is incorrect.",
        "quantity": "Stock Quantity",
        "placeholder_quant": "Enter the available quantity",
        "error_quant": "The quantity is incorrect.",
        "category": "Product Category",
        "category_select": "Choose a category",
        "error_cat": "Please select a category.",
        "button": "Add Product",
        "successful_title": "Your product has been successfully added!",
        "successful_text": "You can now view your product's page by clicking the button below.",
        "button1": "View Product Page",
        "button2": "Go Back to Homepage",
        "failure_title": "An error occurred.",
        "failure_text": "Your product could not be added. Please try again later.",
        "button3": "Close"
    },
    "comment_list": {
        "title": "No comment for this product."
    },
    "market": {
        "key_word": "Keywords",
        "placeholder_kword": "Search",
        "category": "Category",
        "category_button": "All Categories",
        "seller": "Seller",
        "price": "Price",
        "button_apply": "Apply Filters",
        "button_reset": "Reset"
    },
    "product_card": {
        "seller": "Sold by "
    },
    "product_list": {
        "no_prod": "No products match your search.",
        "add": "New product"
    },
    "edit_form": {
        "seller": "Seller: ",
        "quantity": "New quantity:",
        "placeholder_quant":"Enter the available quantity",
        "error_quant":"The quantity is incorrect.",
        "button": "Edit",
        "remove": "Remove",
        "successful_title": "Your product has been successfully edited!",
        "successful_text": "You can now view your product's page by clicking the button below.",
        "button1": "View Product Page",
        "button2": "Go Back to Homepage",
        "failure_title": "An error occurred.",
        "failure_text": "Your product could not be edited. Please try again later.",
        "button3": "Close"
    }
}