{
    "nav": {
        "market": "Produits",
        "orders": "Mes commandes",
        "cart": "Mon Panier",
        "sales": "Ventes",
        "product-management": "Mes produits",
        "about": "À propos",
        "login": "Se connecter",
        "signup": "S'inscrire",
        "logout": "Se déconnecter"
    },
    "home": {
        "title": "Créez sans limites avec Creator Emporium",
        "subtitle": "L'atelier de vos rêves à portée de clics !",
        "m_info": "Plus d'informations",
        "market": "Produits"
    },
    "m_info": {
        "title": "Bienvenue sur Creator Emporium - Votre boutique en ligne de kits de DIY",
        "text1": "Bienvenue sur Creator Emporium, l'endroit idéal pour tous les passionnés de DIY ! Nous sommes une boutique en ligne spécialisée dans la vente de kits de bricolage qui vous permettent de laisser libre cours à votre créativité. Que vous soyez débutant ou expert, notre vaste sélection de kits saura satisfaire toutes vos envies de création. Voici ce que vous pouvez attendre en choisissant Creator Emporium :",
        "text2": "Des kits de DIY pour tous les niveaux:",
        "text3": "Que vous souhaitiez vous initier à une nouvelle technique ou relever un défi plus avancé, nous avons des kits adaptés à tous les niveaux de compétence. Nos packs sont soigneusement conçus avec des instructions claires et des matériaux de qualité pour vous assurer une expérience de bricolage réussie.",
        "text4": "Une diversité de projets passionnants:",
        "text5": "Explorez notre vaste gamme de kits de bricolage dans différents domaines tels que la couture, la décoration, la bijouterie, la peinture et bien d'autres encore. Que vous préfériez créer des objets pratiques ou des pièces décoratives uniques, nous avons le kit parfait pour vous.",
        "text6": "La commodité de tout-en-un:",
        "text7": "Nos kits sont conçus pour vous offrir tout ce dont vous avez besoin pour réaliser votre projet. Fini le temps perdu à chercher les matériaux nécessaires ! Avec Creator Emporium, vous recevrez un ensemble complet comprenant les fournitures, les outils et les instructions détaillées, vous permettant de vous lancer sans attendre.",
        "text8": "Des matériaux de qualité:",
        "text9": "Nous attachons une grande importance à la qualité de nos produits. Tous nos kits sont confectionnés avec des matériaux durables et sélectionnés avec soin, vous garantissant des résultats durables et esthétiques. Nous veillons à ce que chaque composant de nos kits réponde à nos normes élevées.",
        "text10": "Une communauté inspirante:",
        "text11": "Rejoignez la communauté Creator Emporium et connectez-vous avec d'autres passionnés de DIY. Partagez vos réalisations, échangez des idées, posez des questions et trouvez l'inspiration pour vos prochains projets. Notre communauté est un lieu d'échange chaleureux où vous pourrez vous sentir soutenu et encouragé.",
        "text12": "Que vous soyez à la recherche d'un nouveau hobby, d'un cadeau unique ou simplement d'une expérience de bricolage gratifiante, Creator Emporium est là pour vous accompagner dans votre parcours créatif. Parcourez notre boutique en ligne dès aujourd'hui et laissez votre imagination prendre vie grâce à nos kits de DIY exceptionnels!"
    },
    "login": {
        "title": "Connectez-vous :",
        "email": "Adresse mail",
        "placeholder_email": "nom@exemple.com",
        "passwd": "Mot de passe",
        "placeholder_pwd": "Mot de passe",
        "button": "Se connecter",
        "reg_question": "Pas encore de compte ?",
        "register": "Créer un compte"
    },
    "register": {
        "title": "S'inscrire :",
        "email": "Adresse mail",
        "email_error": "Veuillez entrer une adresse email valide",
        "placeholder_email": "Entrez votre email",
        "passwd": "Mot de passe",
        "pwd_error": "Le mot de passe doit comporter au moins 6 charactères",
        "placeholder_pwd": "Mot de passe",
        "button": "S'inscrire",
        "choices": "Je veux m'inscrire sur CreatorCentral pour :",
        "choice1": "acheter des articles",
        "choice2": "vendre mes produits",
        "nickname": "Nom d'affichage",
        "placeholder_nickname": "Entrez votre nom d'affichage",
        "nick_desc": "Il s'agit du nom que verront vos clients."
    },
    "product_page": {
        "seller": "Vendu par ",
        "stock1": "Il reste ",
        "stock2": " produits",
        "CGV": "Lire les conditions générales de ventes.",
        "add2cart": "Ajouter au panier",
        "buy": "Acheter maintenant",
        "comments": "Commentaires :"
    },
    "modal": {
        "title": "Conditions générales de vente :",
        "text1": "Avant de procéder à votre achat, veuillez prendre connaissance attentivement des conditions générales suivantes :",
        "elem1": "Disponibilité des produits : La disponibilité du produit est sujette à des changements et peut varier en fonction des niveaux de stock. Nous nous efforçons de maintenir des informations précises sur les stocks, mais il est possible qu'un article soit temporairement ou définitivement en rupture de stock. Dans de tels cas, nous vous en informerons rapidement et vous proposerons des options alternatives ou un remboursement.",
        "elem2": "Descriptions des produits : Nous mettons tout en œuvre pour fournir des descriptions précises et détaillées de nos produits. Cependant, veuillez noter que les images, les couleurs et les spécifications des produits peuvent légèrement varier par rapport au produit réel en raison des conditions d'éclairage, des paramètres du moniteur ou des mises à jour du fabricant. Nous vous encourageons à lire attentivement les détails du produit et à contacter notre équipe d'assistance clientèle si vous avez des questions spécifiques.",
        "elem3": "Tarification et paiement : Les prix indiqués sur notre site web sont sujets à des modifications sans préavis. Bien que nous nous efforcions de maintenir des informations de tarification précises, des écarts occasionnels peuvent se produire. Dans le cas où un produit est affiché à un prix incorrect, nous nous réservons le droit d'annuler votre commande ou de vous contacter pour obtenir de plus amples instructions. Veuillez vous assurer que toutes les informations de paiement fournies sont exactes et à jour.",
        "elem4": "Expédition et livraison : Nous nous efforçons de traiter et d'expédier les commandes dans les délais spécifiés. Cependant, veuillez noter que les délais de livraison peuvent varier en fonction de votre emplacement, du transporteur et de toute circonstance imprévue. Nous ne pouvons garantir des dates de livraison exactes, mais nous vous fournirons des informations de suivi pour suivre l'avancement de votre colis. Des frais de douane supplémentaires, des droits ou des taxes peuvent s'appliquer aux commandes internationales.",
        "elem5": "Retours et remboursements : Nous avons mis en place une politique de retour complète pour garantir votre satisfaction. Si vous rencontrez des problèmes avec votre achat, veuillez contacter notre équipe d'assistance clientèle dans le délai désigné spécifié dans notre politique de retour. Veuillez noter que certains produits, tels que les articles personnalisés ou les produits périssables, peuvent ne pas être éligibles au retour.",
        "text2": "En procédant à votre achat, vous reconnaissez avoir lu et compris les conditions générales mentionnées ci-dessus. Si vous avez des questions ou des préoccupations, n'hésitez pas à contacter notre équipe d'assistance clientèle pour obtenir une aide supplémentaire.",
        "button": "Fermer"
    },
    "transactions": {
        "title1": "Aucun historique",
        "title2": "Produits vendus :",
        "title3": "Vous avez achetés :",
        "col1": "Date",
        "col2": "Nom du produit",
        "col3": "Quantité",
        "col4": "Nom du vendeur",
        "col5": "Nom de l'acheteur",
        "col6": "Prix total"
    },
    "comment_form": {
        "pre_title": "Ecrire un commentaire",
        "title": "Titre",
        "placeholder_title": "Entrez le titre du commentaire",
        "title_error": "Le commentaire doit comporter un titre.",
        "description": "Description",
        "placeholder_desc": "Entrez la description du produit",
        "grade": "Note",
        "choose_grade": "Choisissez une note",
        "grade_error": "Veuillez sélectionner une note",
        "button": "Envoyer le commentaire"
    },
    "new_product": {
        "title": "Ajout de produit",
        "product_name": "Nom du produit",
        "placeholder_prod": "Entrez le nom du produit",
        "product_error": "Le produit doit comporter un nom.",
        "description": "Description",
        "placeholder_desc": "Entrez la description du produit",
        "error_desc": "Le produit doit comporter une description.",
        "image": "Ajoutez une image",
        "error_image": "Le produit doit comporter une image (format png, jpg, ou jpeg).",
        "price": "Prix",
        "placeholder_price": "Entrez un prix",
        "error_price": "Le prix est incorrect.",
        "quantity": "Quantité en stock",
        "placeholder_quant": "Entrez la quantité disponible",
        "error_quant": "La quantité est incorrecte",
        "category": "Catégorie produit",
        "category_select": "Choisissez une catégorie",
        "error_cat": "Veuillez sélectionner une catégorie.",
        "button": "Ajouter le produit",
        "successful_title": "Votre produit a bien été ajouté !",
        "successful_text": "Vous pouvez dès maintenant consulter la page de votre produit en cliquant sur le bouton ci-dessous.",
        "button1": "Voir la page du produit",
        "button2": "Revenir à l'accueil",
        "failure_title": "Une erreur s'est produite.",
        "failure_text": "Votre produit n'a pas pu être ajouté. Veuillez réessayer plus tard.",
        "button3": "Fermer"
    },
    "comment_list": {
        "title": "Aucun commentaire pour ce produit."
    },
    "market": {
        "key_word": "Mots-clés",
        "placeholder_kword": "Recherche",
        "category": "Catégorie",
        "category_button": "Toutes les catégories",
        "seller": "Vendeur",
        "price": "Prix",
        "button_apply": "Appliquer les filtres",
        "button_reset": "Réinitialiser"
    }
}